adembc/tap/lazyssh
bat
blueutil
btop
coreutils
croc
ctop
derailed/popeye/popeye
duf
entr
eza
fastfetch
fd
felixkratz/formulae/borders
ffmpeg
fzf
fzf-tab
gdu
git-delta
gitleaks
helm
htop
imagemagick
jandedobbeleer/oh-my-posh/oh-my-posh
jq
just
k9s
lazydocker
lazygit
librsvg
luarocks
minikube
ncdu
neovim
nnn
pandoc
poppler
pinentry
pwgen
ripgrep
sesh
sevenzip
stern
stow
tealdeer
the_silver_searcher
tig
tilt
tmux
tree
watch
worktrunk
yazi
yq
zoxide
zsh-syntax-highlighting
