bat
blueutil
btop
croc
ctop
derailed/popeye/popeye
entr
eza
fastfetch
fd
ffmpeg
fzf
git-delta
helm
htop
imagemagick
jq
k9s
koekeishiya/formulae/yabai
lazydocker
lazygit
librsvg
luarocks
minikube
neovim
pandoc
poppler
pwgen
ripgrep
sevenzip
starship
stern
stow
the_silver_searcher
tig
tilt
tldr
tmux
tree
watch
yazi
zoxide
zsh-syntax-highlighting
