tap "achannarasappa/tap"
tap "adembc/tap"
tap "derailed/popeye"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "henrygd/beszel"
tap "homebrew-ffmpeg/ffmpeg"
tap "iina/mpv-iina"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "lusingander/tap"
tap "nikitabobko/tap"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Library to render SVG files using Cairo
brew "librsvg"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Core component of the AcoustID project (Audio fingerprinting)
brew "chromaprint"
# Anti-virus software
brew "clamav"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# Top-like interface for container metrics
brew "ctop"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Replace zsh completion selection menu with fzf
brew "fzf-tab"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Kubernetes package manager
brew "helm"
# Client library for huggingface.co hub
brew "hf"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Terminal-based video trimming TUI
brew "lazycut"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal-based SSH manager
brew "lazyssh"
# Package manager for the Lua programming language
brew "luarocks"
# Sudoless performance monitoring for Apple Silicon processors
brew "macmon"
# Run a Kubernetes cluster locally
brew "minikube"
# Media player based on MPlayer and mplayer2
brew "mpv"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Terminal slideshow tool
brew "presenterm"
# Show ps output as a tree
brew "pstree"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Rsync for cloud storage
brew "rclone"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Smart session manager for the terminal
brew "sesh"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# SMART hard drive monitoring
brew "smartmontools"
# SOcket CAT: netcat on steroids
brew "socat"
# Editor of encrypted files
brew "sops"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# General purpose fuzzy finder TUI
brew "television"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Source code spell checker
brew "typos-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for managing SSH connections.  
brew "adembc/tap/lazyssh"
# A Kubernetes Cluster sanitizer and linter!
brew "derailed/popeye/popeye"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Tools to protect your emails and files
cask "gpg-suite"
# Menu bar manager
cask "jordanbaird-ice"
# File archiver
cask "keka"
# Replacement for Docker Desktop
cask "orbstack"
# System monitor for the menu bar
cask "stats"
